---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions.StartStation
source: html/5c74eaa0-bca8-10a8-a901-78de4111477b.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions.StartStation Property

The starting station for creating labels in the set, in Revit internal model units (standard Imperial feet).
 The default value is null.
 When null, the station value corresponding to the alignment's DisplayedStartStation is used.

## Syntax (C#)
```csharp
public Nullable<double> StartStation { get; set; }
```